{
  "Professional Summary": "A dynamic University of Central Florida alumnus with a Bachelor's in Biotechnology and a minor in Physics, I am on a professional trajectory marked by the seamless integration of academic rigor and a burgeoning expertise in programming and system architecture. Since graduating, my two-year journey in the industry has been distinguished by significant contributions in R&D roles, demonstrating my readiness to tackle complex, high-stakes challenges.\nThough I am in the early stages of large-scale project management, my proficiency in backend development and a history of innovative problem-solving in entrepreneurial settings stand out. This unique blend of academic excellence and hands-on practicality is driven by an unwavering passion for research, technology, and the quest for novel breakthroughs. My skill set includes not only a strong foundation in quantum simulations and biomolecular research but also an adeptness in programming languages and software development practices, positioning me uniquely for roles that demand both scientific acumen and technical prowess.\n",
  "Research Experience": [
    {
      "Period": "August 2019 - December 2022",
      "Institution": "Physics Department, University of Central Florida",
      "Position": "OPS Researcher Position",
      "Focus": "Quantum Charge Migration in Conjugate Systems",
      "Contributions": [
        "Algorithm Development for Quantum Simulations: Developed algorithms enhancing data processing in electronic systems study. Included ab-initio simulations of decoherence and relaxation in N-methylacetamide using Density Matrix Formalism and Open-System Lindblad Equation.",
        "Research in Biomolecular Charge Propagation: Conducted studies on charge propagation in biomolecules using computational methods and analytical tools. Work involved Becke's Partitioning Algorithm on 3D Electronic Density Grid computed from Multi-Configuration Self-Consistent Field simulations, studying dynamics of charge migration in molecular systems.",
        "Code Development for Research: Key role developing and maintaining computational codes essential for quantum physics research. Consisted of Fortran and Python codebases and contributed to their integration into ASTRA (AttoSecond TRAnsitions) program, ensuring support for complex quantum calculations and simulations.",
        "Ongoing Academic Writing and Research: Actively authoring a manuscript summarizing key findings and methodologies from undergraduate research and OPS role. The paper aim to provide a comprehensive resource for peers in the field to utilize the tools created over the past 4 years."
      ]
    }
  ],
  "Conference Talks": [
    {
      "Title": "Spectral Signature of Molecular Charge Migration",
      "Events": [
        "32nd International Conference on Photonic, Electronic and Atomic Collisions",
        "88th Southeastern Section of the APS Meeting",
        "Attochem Young Scientists Symposium 2021"
      ]
    },
    {
      "Title": "Charge Migration in Light-Harvesting Chromophores",
      "Events": [
        "Division of Atomic, Molecular and Optical Physics",
        "National Conference on Undergraduate Research",
        "Showcase of Undergraduate Research Excellence",
        "Florida Undergraduate Research Conference 2020"
      ]
    }
  ],
  "Education": [
    {
      "Degree": "Bachelor of Science Biotechnology",
      "Minor": "Physics",
      "Institution": "University of Central Florida Orlando",
      "Graduation Date": "December 2022",
      "Relevant Coursework": [
        "Directed Independent Studies on Energy Transfer in Biomolecules",
        "Experimental Molecular Cell Biology",
        "Biochemistry",
        "Organic Chemistry"
      ]
    },
    {
      "Degree": "Associate of Arts Chemistry Track",
      "Institution": "Hillsborough Community College Tampa, FL",
      "Graduation Date": "August 2017"
    }
  ],
  "Grants": [
    "Project Participant of Department of Energy Office of Science Grant - 'New correlated numerical methods for attosecond molecular single and double ionization'",
    "Contributor of National Science Foundation supported 'Attosecond Photoemission Dynamics: Novel AB Initio Methods for Atomic and Molecular Ex-situ Spectrscopies' project",
    "Research Experience for Undergraduates Grant by the National Science Foundation",
    "Judges' Choice Award at the 2021 Student Scholar Symposium",
    "UCF Scholars Award",
    "UCF Orion Grant"
  ],
  "Skills": {
    "Laboratory": [
      "Proficient in DNA/protein quantification and purification, inoculation, and cell culture techniques."
    ],
    "Languages": [
      "Proficient in Python, intermediate in Fortran, and knowledgeable in Rust, JavaScript, and HTML.",
      "Spanish Native Level Speaking, Reading, & Writing"
    ],
    "Software Practices": [
      "Experienced in complex problem-solving, software documentation control, debugging, and software design."
    ],
    "Web Development": [
      "Skilled in FastAPI, Uvicorn, Pydantic"
    ],
    "DevOps & Virtualization": [
      "Knowledgeable in Docker, Kubernetes, Terraform, and cloud platforms like AWS and GCP."
    ],
    "Libraries and Frameworks": [
      "Skilled in Sklearn, SciPy, Keras, TensorFlow, RAPIDS, Ray, Pandas, Numpy, Dask, and Numba."
    ],
    "Databases": [
      "Experience with PostgreSQL, Redis, Apache Kafka, MySQL, MongoDB, and Firestore."
    ],
    "Version Control": [
      "Competent with Git and familiar with platforms like GitHub, GitLab, and Bitbucket."
    ]
  }
}
